In [1]:
import pandas as pd

                                 DataFrame using List

In [11]:
data = [['Aditya', 94], ['harry', 84], ['Jill', 74], ['Jacob', 64], ['jack', 54], ['Jerry', 44]]
print(data)

[['Aditya', 94], ['harry', 84], ['Jill', 74], ['Jacob', 64], ['jack', 54], ['Jerry', 44]]

In [12]:
df = pd.DataFrame(data, columns=["Name", "Marks"])
print(df)

     Name  Marks
0  Aditya     94
1   harry     84
2    Jill     74
3   Jacob     64
4    jack     54
5   Jerry     44

                                 DataFrame using dict

In [4]:
data = {
    "a": [4, 6, 3],
    "b": [56, 34, 78]
}
print(data)

{'a': [4, 6, 3], 'b': [56, 34, 78]}

In [5]:
df1 = pd.DataFrame(data)
print(df1)

   a   b
0  4  56
1  6  34
2  3  78

                                  DataFrame using Numpy

In [6]:
import numpy as np

In [7]:
arr = np.array([[1, 2], [3, 4]])
ndf = pd.DataFrame(arr, columns=["A", "B"])
print(ndf)

   A  B
0  1  2
1  3  4

                                   Read file

In [13]:
excel = pd.read_excel("data.xlsx")
print(excel)

      Name School  Marks
0   Aditya     x1     11
1  Shubham     x2     12
2   Robert     x3     13
3    Steve     x4     14
4     Alex     x5     15
5   Batman     x6     16
6   Bryuce     x7     17

In [14]:
csv = pd.read_csv("data.csv")
print(csv)

      Name School  Marks
0   Aditya     x1     11
1  Shubham     x2     12
2   Robert     x3     13
3    Steve     x4     14
4     Alex     x5     15
5   Batman     x6     16
6   Bryuce     x7     17

In [16]:
iris = 'http://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.data'
bill = 'https://raw.githubusercontent.com/mwaskom/seaborn-data/master/tips.csv'
url = pd.read_csv(bill)
print(url)

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [17]:
url.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [18]:
url.tail()

     total_bill   tip     sex smoker   day    time  size
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

In [19]:
url.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    object
 3   smoker      244 non-null    object
 4   day         244 non-null    object
 5   time        244 non-null    object
 6   size        244 non-null    int64
dtypes: float64(2), int64(1), object(4)
memory usage: 13.5+ KB

In [20]:
url.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [23]:
url.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

In [24]:
url.shape

(244, 7)